website/app/controllers/sessions_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`studentID` IS NULL LIMIT 1
---
  def create
     user = Student.find_by(studentID: params[:session][:studentID])